loading/artillery-server.yml
# scaling up from 10 RPS -> 1K rps in 50 sec intervals
# generated from bash:
# for i in `seq 10 10 1000` ; do
# echo '    - duration: 50' >> test.yml &&
# echo "      arrivalRate: ${i}" >> test.yml &&
# echo "      name: \"${i} RPS\"" >> test.yml ;
# done

config:
  target: "http://localhost:3003"
  phases:
    - duration: 50
      arrivalRate: 10
      name: "10 RPS"
    - duration: 50
      arrivalRate: 20
      name: "20 RPS"
    - duration: 50
      arrivalRate: 30
      name: "30 RPS"
    - duration: 50
      arrivalRate: 40
      name: "40 RPS"
    - duration: 50
      arrivalRate: 50
      name: "50 RPS"
    - duration: 50
      arrivalRate: 60
      name: "60 RPS"
    - duration: 50
      arrivalRate: 70
      name: "70 RPS"
    - duration: 50
      arrivalRate: 80
      name: "80 RPS"
    - duration: 50
      arrivalRate: 90
      name: "90 RPS"
    - duration: 50
      arrivalRate: 100
      name: "100 RPS"
    - duration: 50
      arrivalRate: 110
      name: "110 RPS"
    - duration: 50
      arrivalRate: 120
      name: "120 RPS"
    - duration: 50
      arrivalRate: 130
      name: "130 RPS"
    - duration: 50
      arrivalRate: 140
      name: "140 RPS"
    - duration: 50
      arrivalRate: 150
      name: "150 RPS"
    - duration: 50
      arrivalRate: 160
      name: "160 RPS"
    - duration: 50
      arrivalRate: 170
      name: "170 RPS"
    - duration: 50
      arrivalRate: 180
      name: "180 RPS"
    - duration: 50
      arrivalRate: 190
      name: "190 RPS"
    - duration: 50
      arrivalRate: 200
      name: "200 RPS"
    - duration: 50
      arrivalRate: 210
      name: "210 RPS"
    - duration: 50
      arrivalRate: 220
      name: "220 RPS"
    - duration: 50
      arrivalRate: 230
      name: "230 RPS"
    - duration: 50
      arrivalRate: 240
      name: "240 RPS"
    - duration: 50
      arrivalRate: 250
      name: "250 RPS"
    - duration: 50
      arrivalRate: 260
      name: "260 RPS"
    - duration: 50
      arrivalRate: 270
      name: "270 RPS"
    - duration: 50
      arrivalRate: 280
      name: "280 RPS"
    - duration: 50
      arrivalRate: 290
      name: "290 RPS"
    - duration: 50
      arrivalRate: 300
      name: "300 RPS"
    - duration: 50
      arrivalRate: 310
      name: "310 RPS"
    - duration: 50
      arrivalRate: 320
      name: "320 RPS"
    - duration: 50
      arrivalRate: 330
      name: "330 RPS"
    - duration: 50
      arrivalRate: 340
      name: "340 RPS"
    - duration: 50
      arrivalRate: 350
      name: "350 RPS"
    - duration: 50
      arrivalRate: 360
      name: "360 RPS"
    - duration: 50
      arrivalRate: 370
      name: "370 RPS"
    - duration: 50
      arrivalRate: 380
      name: "380 RPS"
    - duration: 50
      arrivalRate: 390
      name: "390 RPS"
    - duration: 50
      arrivalRate: 400
      name: "400 RPS"
    - duration: 50
      arrivalRate: 410
      name: "410 RPS"
    - duration: 50
      arrivalRate: 420
      name: "420 RPS"
    - duration: 50
      arrivalRate: 430
      name: "430 RPS"
    - duration: 50
      arrivalRate: 440
      name: "440 RPS"
    - duration: 50
      arrivalRate: 450
      name: "450 RPS"
    - duration: 50
      arrivalRate: 460
      name: "460 RPS"
    - duration: 50
      arrivalRate: 470
      name: "470 RPS"
    - duration: 50
      arrivalRate: 480
      name: "480 RPS"
    - duration: 50
      arrivalRate: 490
      name: "490 RPS"
    - duration: 50
      arrivalRate: 500
      name: "500 RPS"
    - duration: 50
      arrivalRate: 510
      name: "510 RPS"
    - duration: 50
      arrivalRate: 520
      name: "520 RPS"
    - duration: 50
      arrivalRate: 530
      name: "530 RPS"
    - duration: 50
      arrivalRate: 540
      name: "540 RPS"
    - duration: 50
      arrivalRate: 550
      name: "550 RPS"
    - duration: 50
      arrivalRate: 560
      name: "560 RPS"
    - duration: 50
      arrivalRate: 570
      name: "570 RPS"
    - duration: 50
      arrivalRate: 580
      name: "580 RPS"
    - duration: 50
      arrivalRate: 590
      name: "590 RPS"
    - duration: 50
      arrivalRate: 600
      name: "600 RPS"
    - duration: 50
      arrivalRate: 610
      name: "610 RPS"
    - duration: 50
      arrivalRate: 620
      name: "620 RPS"
    - duration: 50
      arrivalRate: 630
      name: "630 RPS"
    - duration: 50
      arrivalRate: 640
      name: "640 RPS"
    - duration: 50
      arrivalRate: 650
      name: "650 RPS"
    - duration: 50
      arrivalRate: 660
      name: "660 RPS"
    - duration: 50
      arrivalRate: 670
      name: "670 RPS"
    - duration: 50
      arrivalRate: 680
      name: "680 RPS"
    - duration: 50
      arrivalRate: 690
      name: "690 RPS"
    - duration: 50
      arrivalRate: 700
      name: "700 RPS"
    - duration: 50
      arrivalRate: 710
      name: "710 RPS"
    - duration: 50
      arrivalRate: 720
      name: "720 RPS"
    - duration: 50
      arrivalRate: 730
      name: "730 RPS"
    - duration: 50
      arrivalRate: 740
      name: "740 RPS"
    - duration: 50
      arrivalRate: 750
      name: "750 RPS"
    - duration: 50
      arrivalRate: 760
      name: "760 RPS"
    - duration: 50
      arrivalRate: 770
      name: "770 RPS"
    - duration: 50
      arrivalRate: 780
      name: "780 RPS"
    - duration: 50
      arrivalRate: 790
      name: "790 RPS"
    - duration: 50
      arrivalRate: 800
      name: "800 RPS"
    - duration: 50
      arrivalRate: 810
      name: "810 RPS"
    - duration: 50
      arrivalRate: 820
      name: "820 RPS"
    - duration: 50
      arrivalRate: 830
      name: "830 RPS"
    - duration: 50
      arrivalRate: 840
      name: "840 RPS"
    - duration: 50
      arrivalRate: 850
      name: "850 RPS"
    - duration: 50
      arrivalRate: 860
      name: "860 RPS"
    - duration: 50
      arrivalRate: 870
      name: "870 RPS"
    - duration: 50
      arrivalRate: 880
      name: "880 RPS"
    - duration: 50
      arrivalRate: 890
      name: "890 RPS"
    - duration: 50
      arrivalRate: 900
      name: "900 RPS"
    - duration: 50
      arrivalRate: 910
      name: "910 RPS"
    - duration: 50
      arrivalRate: 920
      name: "920 RPS"
    - duration: 50
      arrivalRate: 930
      name: "930 RPS"
    - duration: 50
      arrivalRate: 940
      name: "940 RPS"
    - duration: 50
      arrivalRate: 950
      name: "950 RPS"
    - duration: 50
      arrivalRate: 960
      name: "960 RPS"
    - duration: 50
      arrivalRate: 970
      name: "970 RPS"
    - duration: 50
      arrivalRate: 980
      name: "980 RPS"
    - duration: 50
      arrivalRate: 990
      name: "990 RPS"
    - duration: 50
      arrivalRate: 1000
      name: "1000 RPS"
scenarios:
  - flow:
    - get:
        url: "/"